// ═══════════════════════════════════════════════════════════
// 👑 KIRA - اقتباسات
// المطور: Ayman ♛
// الوصف: شوتشوف
// ═══════════════════════════════════════════════════════════

module.exports.config = {
	name: "اقتباسات",
  aliases: [],
	version: "1.1.2",
	hasPermssion: 0,
	credits: "Ayman ♛",
	description: "شوتشوف",
	commandCategory: "utility",
	usages: "ا",
	cooldowns: 1,
};
module.exports.handleEvent = function ({ api, event }) {
	const { commands } = global.client;
	
	if (!event.body) return;

	const { threadID, messageID, body } = event;

	if (body.indexOf("askme") != 0) return;

	const splitBody = body.slice(body.indexOf("askme")).trim().split(/\s+/);


	if (splitBody.length == 1 || !commands.has(splitBody[1].toLowerCase())) return;

	const threadSetting = global.data.threadData.get(parseInt(threadID)) || {};
	const command = commands.get(splitBody[1].toLowerCase());

	const prefix = (threadSetting.hasOwnProperty("PREFIX")) ? threadSetting.PREFIX : global.config.PREFIX;

	return api.sendMessage(`⚔️ ${command.config.name} ⚔️\n${command.config.description}\n\n❯ Cách sử dụng: ${prefix}${command.config.name} ${(command.config.usages) ? command.config.usages : ""}\n❯ Thuộc nhóm: ${command.config.commandCategory}\n❯ Thời gian chờ: ${command.config.cooldowns} giây(s)\n❯ Quyền hạn: ${((command.config.hasPermssion == 0) ? "Người dùng" : (command.config.hasPermssion == 1) ? "Quản trị viên" : "Người vận hành bot" )}\n❯ Prefix: ${prefix}\n\n» Module code by ${command.config.credits} «`, threadID, messageID);
};

module.exports.run = async function({ api, args, Users, event, Threads, utils, client }) {
const { commands } = global.client;
const { threadID, messageID } = event;
const command = commands.get((args[0] || "").toLowerCase());
const threadSetting = global.data.threadData.get(parseInt(threadID)) || {};
if (!command) {
const command = commands.values();
var tl = [ 
       " أحياناً.. ويصبح الوهم حقيقه😪.",
      " الجمال يلفت الأنظار لكن الطيبه تلفت القلوب🙂 .!",
      "لا تحقرون صغيره إن الجبال من الحصي 💖",
      "لا تمد عينك في يد غيرك 💕",
      "‏ بعض الاِعتذارات يجب أن تُرفَضّ. 🌚.",
      "‏ هل كانت كل الطرق تؤدي إليكِ، أم أنني كنتُ أجعلها كذلك. 🤫 .!",
      "ويُرهقني أنّي مليء بما لا أستطيع قوله.✨ ",
      "‏أَكَان عَلَيَّ أَنْ أغْرَس انيابي فِي قَلْبِك لتشعر بِي ؟. 😁",
      "‏ إن الأمر ينتهي بِنا إلى أعتياد أي شيء. 😎",
      "‏ بعض الاِعتذارات يجب أن تُرفَضّ. 😃",
      "لا تظلم حتى لا تتظلم 😊",
      "لا حياه للإنسان بلا نبات ☺️",
      "لا تقف قصاد الريح ولا تمشي معها.... ❤️",
      " لا تملح الا لمن يستحقاها ويحافظ عليها😛",
      "لا يدخل الجنه من لايأمن من جازه بوائقه 😿.",
      "لا دين لمن لا عهد له 💞 ",
      "لا تظلم حتى لا تتظلم 🌚.",
      "عامل الناس بأخلاقك ولا بأخلاقهم 💞⛷️",
      "لا تقف قصاد الريح ولا تمشي معها.... 💚 ",
      "‏ ‏أحببتك وأنا منطفئ، فما بالك وأنا في كامل توهجي ؟ 🙂 .!",
      "‏من ترك أمرهُ لله، أعطاه الله فوق ما يتمنَّاه💙 ",
      "‏ إنعدام الرّغبة أمام الشّيء الّذي أدمنته ، انتصار. »💛",
      "‏ ‏كل العالم يهون بس الدنيا بينا تصفي 💙 ",
      "‏ إن الأمر ينتهي بِنا إلى أعتياد أي شيء. 😚 ",
      "‏ إنعدام الرّغبة أمام الشّيء الّذي أدمنته ، انتصار. 💝",
      "‏ لا تعودني على دفء شمسك، إذا كان في نيتك الغروب .َ 🙂 .!",
      "‏من علامات جمال المرأة .. بختها المايل ! ❤️",
      "‏ علينا إحياء زَمن الرّسائل الورقيّة وسط هذه الفوضى الالكترونية العَارمة.💜 ",
      "‏ كلما أتبع قلبي يدلني إليك . 😜",
      "‏ انك الجميع و كل من احتل قلبي🫀🤍 ",
      "‏ بس لما أنا ببقى فايق، ببقى أبكم له ودان.💖 ",
      "‏ ‏ممكن اكون اختارت غلط بس والله حبيت بجد🖇️ ",
      "‏ لا تعودني على دفء شمسك، إذا كان في نيتك الغروب .َ 💕",
      " ‏ ‏تبدأ حياتك محاولاً فهم كل شيء، وتنهيها محاولاً النجاة من كل ما فهمت.💖",
      "الجمال يلفت الأنظار لكن الطيبه تلفت القلوب 😁",
      "كما تدين تدان 😊",
      "عامل الناس بأخلاقك ولا بأخلاقهم 🙂",
      "يسروا ولا تعسروا... ويشورا ولا تنفروا 💕",
      " لا يدخل الجنه من لايأمن من جازه بوائقه💓",
      " كل كتير عادي ميهمكش😂❤️",
      "لا تملح الا لمن يستحقاها ويحافظ عليها 💞 ",
      " الجمال يلفت الأنظار لكن الطيبه تلفت القلوب💞 ",
      " خليك طبيعي مش نورم😇❤️ ",
      " الدنيا حلوه متزعلش علي ناس ماتستاهلش🌝🏃‍♂️",
      " العقل السليم ف البعد عن الحريم😇❤️",
      "عيش الحياه يوم واحد 🙂 .! ",
      "امشي كتير عشان تخس 🧐 .! ",
      " اشرب ميه كتير 😎.",
      "كُنْ لحوحاً فِي الدّعاءِ،فقدْ أوشكَ السّهمُ أنْ يُصيبَ. 💗",                    
      "‏من ترك أمرهُ لله، أعطاه الله فوق ما يتمنَّاه💙 ", 
      "‏من علامات جمال المرأة .. بختها المايل ! ",
      "‏ انك الجميع و كل من احتل قلبي🫀🤍",
      "‏ ‏ لقد تْعَمقتُ بكَ كَثيراً والمِيمُ لام .♥️",
      "‏ ‏ممكن اكون اختارت غلط بس والله حبيت بجد🖇️",
      "‏ علينا إحياء زَمن الرّسائل الورقيّة وسط هذه الفوضى الالكترونية العَارمة. ⋆ 💜",
      "‏ يجي اي الصاروخ الصيني ده جمب الصاروخ المصري لما بيلبس العبايه السوده.🤩♥️",
      "‏ كُنت أرقّ من أن أتحمّل كُل تلك القَسوة من عَينيك .🍍",
      "‏أَكَان عَلَيَّ أَنْ أغْرَس انيابي فِي قَلْبِك لتشعر بِي ؟.",
      "‏ •كُلما أتبع قلبي يدلني إليك .",
      "‏ •أيا ليت من تَهواه العينُ تلقاهُ .",
      "‏ ‏: رغبتي في مُعانقتك عميقة جداً .??",
      "ويُرهقني أنّي مليء بما لا أستطيع قوله.✨",
      "‏ من مراتب التعاسه إطالة الندم ع شيء إنتهى. ⋆ ",
      "‏ ‏كل العالم يهون بس الدنيا بينا تصفي 💙",
      "‏ بعض الاِعتذارات يجب أن تُرفَضّ.",
      "‏ ‏تبدأ حياتك محاولاً فهم كل شيء، وتنهيها محاولاً النجاة من كل ما فهمت.",
      "‏ إن الأمر ينتهي بِنا إلى أعتياد أي شيء.",
      "‏ هل كانت كل الطرق تؤدي إليكِ، أم أنني كنتُ أجعلها كذلك.",
      "‏ ‏هَتفضل توآسيهُم وآحد ورآ التآني لكن أنتَ هتتنسي ومحدِش هَيوآسيك.",
      "‏ جَبَرَ الله قلوبِكُم ، وقَلبِي .🍫",
      "‏ بس لما أنا ببقى فايق، ببقى أبكم له ودان.💖",
      "‏ ‏مقدرش عالنسيان ولو طال الزمن 🖤",
      "‏ أنا لستُ لأحد ولا احد لي ، أنا إنسان غريب أساعد من يحتاجني واختفي.",
      "‏ ‏أحببتك وأنا منطفئ، فما بالك وأنا في كامل توهجي ؟",
      "‏ لا تعودني على دفء شمسك، إذا كان في نيتك الغروب .َ",
      "‏ وانتهت صداقة الخمس سنوات بموقف.",
      "‏ ‏لا تحب أحداً لِدرجة أن تتقبّل أذاه.",
      "‏ إنعدام الرّغبة أمام الشّيء الّذي أدمنته ، انتصار.",
      "‏مش جايز , ده اكيد التأخير وارهاق القلب ده وراه عوضاً عظيماً !💙 ",
      " مش جايز , ده اكيد التأخير وارهاق القلب ده وراه عوضاً عظيماً !💙",
      "فـ بالله صبر  وبالله يسر وبالله عون وبالله كل شيئ ♥️. ",
      "أنا بعتز بنفسي جداً كصاحب وشايف اللي بيخسرني ، بيخسر أنضف وأجدع شخص ممكن يشوفه . ",
      "فجأه جاتلى قافله ‏خلتنى مستعد أخسر أي حد من غير ما أندم عليه . ",
      "‏اللهُم قوني بك حين يقِل صبري... ",
      "‏يارب سهِل لنا كُل حاجة شايلين هَمها 💙‏ ",
      "انا محتاج ايام حلوه بقي عشان مش نافع كدا ! ",
      "المشكله مش اني باخد قررات غلط المشكله اني بفكر كويس فيها قبل ما اخدها .. ",
      "تخيل وانت قاعد مخنوق كدا بتفكر فالمزاكره اللي مزكرتهاش تلاقي قرار الغاء الدراسه .. ",
      " مكانوش يستحقوا المعافرة بأمانه.",
      "‏جمل فترة في حياتي، كانت مع اكثر الناس الذين أذتني نفسيًا. ",
      " ‏إحنا ليه مبنتحبش يعني فينا اي وحش!",
      "أيام مُمله ومستقبل مجهول ونومٌ غير منتظموالأيامُ تمرُ ولا شيَ يتغير ", 
      "عندما تهب ريح المصلحه سوف ياتي الجميع رتكدون تحت قدمك ❤️. ",
      "عادي مهما تعادي اختك قد الدنيا ف عادي ❤. ",
      "بقيت لوحدي بمعنا اي انا اصلا من زمان لوحدي.❤️ ",
      "- ‏تجري حياتنا بما لاتشتهي أحلامنا ! ",
      "تحملين كل هذا الجمال، ‏ألا تتعبين؟",
      "البدايات للكل ، والثبات للصادقين ",
      "مُؤخرًا اقتنعت بالجملة دي جدا •Private life always wins. ",
      " الافراط في التسامح بيخللي الناس تستهين بيك🍍",
      "مهما كنت كويس فـَ إنت معرض لـِ الاستبدال.. ",
      "فخوره بنفسي جدًا رغم اني معملتش حاجه فـ حياتي تستحق الذكر والله . ",
      "‏إسمها ليلة القدر لأنها تُغير الأقدار ,اللهُمَّ غير قدري لحالٍ تُحبه وعوضني خير .. ",
      "فى احتمال كبير انها ليلة القدر ادعوا لنفسكم كتير وأدعو ربنا يشفى كل مريض. 💙 ",
      "أنِر ظُلمتي، وامحُ خطيئتي، واقبل توبتي وأعتِق رقبتي يا اللّٰه. إنكَ عفوٌّ تُحِبُّ العفوَ؛ فاعفُ عني 💛 ", 
      ];
var tle = tl[Math.floor(Math.random() * tl.length)];
var lon = ` ${tle}`;
return api.sendMessage(lon, event.threadID, event.messageID);
}
const prefix = (threadSetting.hasOwnProperty("PREFIX")) ? threadSetting.PREFIX : global.config.PREFIX;
return api.sendMessage(`⚔️ ${command.config.name} ⚔️\n${command.config.description}\n\n❯ Cách sử dụng: ${prefix}${command.config.name} ${(command.config.usages) ? command.config.usages : ""}\n❯ Thuộc nhóm: ${command.config.commandCategory}\n❯ Thời gian chờ: ${command.config.cooldowns} giây(s)\n❯ Quyền hạn: ${((command.config.hasPermssion == 0) ? "Người dùng" : (command.config.hasPermssion == 1) ? "Quản trị viên" : "Người vận hành bot" )}\n❯ Prefix: ${prefix}\n\n» Module code by ${command.config.credits} «`, threadID, messageID);
};